#include <iostream>
using namespace std;

//01背包问题（每个元素最多取一次）,不超过背包容量的前提下，使总价值最大

int main() {

	//	定义问题参数
	int N = 4; //	物品总数，编号1到4
	int V = 5; //	背包最大容量

	//	物品体积数组。v[0]不使用，占位，v[1]到v[4]对应物品A到D的体积。
	int v[5] = { 0, 4, 2, 3, 1 };
	//	物品的价值数组。w[0]不使用，占位，w[1]到w[4]对应物品A到D的价值。
	int w[5] = { 0, 2, 4, 4, 5 };

	/*
		定义状态数组dp
		每个元素dp[i][j]的含义为，前i个物品，背包容量为j时，能获得的最大值。
		数组大小(N+1)x(V=1)，覆盖所有状态。
	*/
	int dp[5][6] = {  };

	//	动态规划填表
	//	i从1到N，依次考虑第1个到第N个物品
	for (int i = 1; i <= N; i++) {
		//	j从1到V，依次考虑每个可用的背包容量。
		for (int j = 1; j <= V; j++) {
			//	对于每个可用的背包容量，存在不能装下和可以装下两种情况。
			if (j < v[i]) {
				/*
				情况1： 当前背包容量j小于第i个物品的体积v[i]，无法装入第i个物品，
					只能继承“不选它”的结果
				*/
				dp[i][j] = dp[i - 1][j];
			}
			else {
				/*
				情况2：能装下，考虑要不要装。
					装上价值更大就装；装上价值没有不装大，就不装。
				*/
				dp[i][j] = max(dp[i - 1][j], dp[i - 1][j - v[i]] + w[i]);
			}
		}
	}

	for (int i = 0; i <= N; i++) {
		for (int j = 0; j <= V; j++) cout << dp[i][j] << " ";
		cout << endl;
	}

	cout << "能装入物品的最大价值为: " << dp[N][V] << endl;
	return 0;
}